[
    {
        "_id":  148090,
        "name":  "Roxie Sinner",
        "disambiguation":  null,
        "bio":  "Roxie Sinner is a Syrian-born adult model, porn actress, and webcam girl, but moved to the United States in 2014 due to the war. She\u0027s noted for her porn videos with Reality Kings, Team Skeet, Brazzers, and Bang Bros, as well as a featured model in Playboy in September 2023. Roxie Sinner stands 5\u00276\" tall and weighs 149 pounds with a curvy frame that\u0027s a delight. Her 34DD big natural tits are of course the highlight, but her big round booty is a real treat too.",
        "extras":  {
                       "gender":  "Female",
                       "birthday":  "2000-12-20",
                       "birthday_timestamp":  977270400,
                       "birthplace":  "Damascus, Syria",
                       "ethnicity":  "Middle Eastern",
                       "nationality":  "American, Syrian",
                       "hair_colour":  "Various",
                       "eye_colour":  "Brown",
                       "weight":  "69kg",
                       "height":  "168cm",
                       "measurements":  "34DD-24-35",
                       "cupsize":  "34DD",
                       "tattoos":  "Roman numerals on side of left hand; Left calf; design above left knee",
                       "piercings":  "No Piercings",
                       "career_start_year":  2021
                   },
        "image":  "https://cdn.theporndb.net/performer/b5/ab/b7/8647a526c2feb65b7d3d482c763715a/poster/roxie-sinner-on-team-skeet.jpg"
    },{
        "_id":  164236,
        "name":  "Armani Black",
        "disambiguation":  null,
        "bio":  null,
        "extras":  {
                       "gender":  "Female",
                       "birthday":  "1990-12-30",
                       "birthday_timestamp":  662515200,
                       "birthplace":  "New York, NY, USA",
                       "ethnicity":  "Latin",
                       "nationality":  "American",
                       "hair_colour":  "Brunette",
                       "eye_colour":  "Brown",
                       "weight":  "56kg",
                       "height":  "165cm",
                       "measurements":  "34DD-26-38",
                       "cupsize":  "34DD",
                       "tattoos":  "Inside right wrist; Right side of lower abdomen; Under left biceps",
                       "piercings":  "Navel; Right nipple",
                       "career_start_year":  2021
                   },
        "image":  "https://cdn.theporndb.net/performer/14/b8/b8/01e3219e2a73041e2710135f5b3cb9d/poster/armani-black.webp"
    },
    {
        "_id":  270724,
        "name":  "Kat Marie",
        "disambiguation":  null,
        "bio":  null,
        "extras":  {
                       "gender":  "Female",
                       "birthday":  "1983-06-27",
                       "birthday_timestamp":  425520000,
                       "birthplace":  "Chicago, IL, USA",
                       "ethnicity":  "Caucasian",
                       "nationality":  "American",
                       "hair_colour":  "Brunette",
                       "eye_colour":  "Grey",
                       "height":  "170cm",
                       "measurements":  "36G-27-39",
                       "cupsize":  "36G",
                       "piercings":  "navel; right nostril",
                       "career_start_year":  2023
                   },
        "image":  "https://cdn.theporndb.net/performer/52/ea/90/d825704f8231faf3a4ddbf2801f5a0a/poster/kat-marie.jpg"
    },{
        "_id": 83271,
        "name": "Kagney Linn Karter",
        "disambiguation": null,
        "bio": "When you come on the scene, you want to come on with a bang, and nowhere is that more important than in porn. Here on the porn fronts, the stunning Kagney Linn Karter blew up like a supernova. Early in Kagney’s career, she took the titles for best new starlet and starlet of the year so quickly that she probably didn’t even have time to wipe the money shot off her face before collecting her awards. There is literally nothing Kagney can’t do to send a flood of blood pumping right to the pleasure zones of anybody gaping at her movies. She’s got style, attitude, and a body that looks like it was designed by the best engineers in the world who happen to be horndogs too. Even the glisten of her lips can cause major crotch twitching. It’s not just the boys who love Kagney; she’s got moist magic in her that’ll turn the straightest chick into a muff-munching freak, and what a muff on Kagney! Such a horny girl, she needs extra piercings down there so she can play with herself as much as possible, and she needs that playtime because this girl does work herself to the bone. You can tell she loves screwing for the camera and gives a sporty sweat-filled show every time someone yells action! That’s right, even though she could pose seriously as a normal cover girl model, she chooses the fast-paced hot action of smut cinema. Kagney Linn Karter has the face of an angel but brings out the devil inside all of us.",
        "extras": {
            "gender": "Female",
            "birthday": "1987-03-28",
            "birthday_timestamp": 543888000,
            "birthplace": "United States",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Blonde",
            "eye_colour": "Blue",
            "weight": "54kg",
            "height": "163cm",
            "measurements": "34D-25-36",
            "cupsize": "34D",
            "tattoos": "No Tattoos",
            "piercings": "Above pubes, Two dermals; Navel; Right labia; Vagina",
            "career_start_year": 2008
        },
        "image": "https://cdn.theporndb.net/performer/5a/40/fd/6ffcaae9657043e1e08e795328a7e48/poster/kagney-linn-karter.webp"
    },
    {
        "_id": 135728,
        "name": "Penelope Woods",
        "disambiguation": null,
        "bio": null,
        "extras": {
            "gender": "Female",
            "birthday": "1998-05-02",
            "birthday_timestamp": 894067200,
            "birthplace": "United States",
            "ethnicity": "Latin",
            "nationality": "American",
            "hair_colour": "Brunette",
            "weight": "53kg",
            "height": "160cm",
            "measurements": "34B-27-36",
            "cupsize": "34B",
            "tattoos": "No",
            "piercings": "No"
        },
        "image": "https://cdn.theporndb.net/performer/8c/78/7f/c117d12558fe2b30f19e9f26556c20c/poster/penelope-woods-on-gamma-enterprises.jpeg"
    },
    {
        "_id": 82849,
        "name": "Aubree Valentine",
        "disambiguation": null,
        "bio": "'Naughty Aubree' will fuck your girl, make no mistake about it. One of the highest-earning models on social media, Aubree is a curvaceous brunette with a bubble butt worth swooning over. A former waitress in Hurricane, Utah, Aubree moved out to Las Vegas to start a career as a cam girl, but quickly made the switch to social media platforms to earn way more. When she isn't showing her delicious titties in selfie-mode, Aubree loves to be outdoors fishing, hiking, dirt biking, and just relaxing. This wild Valentine will steal your heart, and you can find out why in the scenes below!",
        "extras": {
            "gender": "Female",
            "birthday": "1998-04-19",
            "birthplace": "United States",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Brunette",
            "eye_colour": "Blue",
            "weight": "49kg",
            "height": "157cm",
            "measurements": "32B-24-34",
            "cupsize": "32B",
            "tattoos": "Inside left ankle; left inner bicep",
            "piercings": "No Piercings",
            "career_start_year": 2019
        },
        "image": "https://cdn.theporndb.net/performer/6e/f4/f2/0074e96ba89cf821a55ec548eec9a4b/poster/aubree-valentine.webp"
    },{
        "_id":  137088,
    "name":  "Charlotte Rayn",
    "disambiguation":  null,
    "bio":  null,
    "extras":  {
                   "gender":  "Female",
                   "birthday":  "1992-09-05",
                   "birthday_timestamp":  715651200,
                   "birthplace":  "Orlando, Florida",
                   "ethnicity":  "Caucasian",
                   "nationality":  "American",
                   "hair_colour":  "Blonde",
                   "eye_colour":  "Brown",
                   "height":  "165cm",
                   "measurements":  "36D-31-39",
                   "cupsize":  "36D",
                   "career_start_year":  2020
               },
    "image":  "https://cdn.theporndb.net/performer/b3/ac/e8/cad22c3342fd3eb69fa9ae3dfb911bf/poster/charlotte-rayn.webp"
    },{
        "_id": 82856,
        "name": "Jane Wilde",
        "disambiguation": null,
        "bio": "Sweet, tender, blonde-haired Jane Wilde, is the ultimate conclusion of any barely legal VR porn fantasy. She’s got the face of a teen angel with freckles that can drive a pair of bouncing balls, or even a juicy pussy, absolutely mad. If you have never been into blondes and preferred some redheads, brunettes and black haired goddesses instead, this sexy golden girl might change your mind and make you start ... arrow_drop_down Sweet, tender, blonde-haired Jane Wilde, is the ultimate conclusion of any barely legal VR porn fantasy. She’s got the face of a teen angel with freckles that can drive a pair of bouncing balls, or even a juicy pussy, absolutely mad. If you have never been into blondes and preferred some redheads, brunettes and black haired goddesses instead, this sexy golden girl might change your mind and make you start craving for them. Just don’t believe in any blonde-related stereotypes, as this girl might surprise you with her intelligence and even make a fool out of you, making you fall in love with her with one of her VR porn fantasies. When you will watch this doll-faced sweetheart slowly peeling her clothing off piece by piece, it will be like one teen miracle coming true after the other. Her little tits, with her occasional sports bra tan lines, are like ripe little plums from the teen sex tree. Her flat tummy, skinny legs and barely curving hips form a wonderland to grope and manhandle – if you’re into some curvy babes, you won’t find them in here, but this hot VR porn vixen will surely make up for that with her other valuable qualities. Jane did some modeling when she was younger and learned all the tricks to make those cameras adore her, and now she is using them all without a moment’s thought to keep mesmerizing all her VR porn viewers. After recording her very first 3D 360 degrees VR porn movie with VR Bangers, she’s now like a rising star who is only getting higher and higher in her career in virtual reality porn business. Do not hesitate any minute longer and get your VR goggles on the head ASAP, as she will not be getting any younger and is waiting for you and your increasingly hardening cock in 4K ultra high definition VR porn videos! arrow_drop_up",
        "extras": {
            "gender": "Female",
            "birthday": "1998-09-23",
            "birthday_timestamp": 906508800,
            "birthplace": "United States",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Blonde",
            "eye_colour": "Hazel",
            "weight": "43kg",
            "height": "153cm",
            "measurements": "32B-22-34",
            "cupsize": "32B",
            "tattoos": "Between breasts, heart outline",
            "piercings": "nipples",
            "career_start_year": 2017
        },
        "image": "https://cdn.theporndb.net/performer/17/88/f4/236bfce90b3873f7a37ea81d0a67cc7/poster/jane-wilde.jpg"
    },{
        "_id":  122759,
        "name":  "Madison Blaze",
        "disambiguation":  null,
        "bio":  null,
        "extras":  {
                       "gender":  "Female",
                       "birthday":  "1992-01-15",
                       "birthday_timestamp":  695433600,
                       "birthplace":  "United States",
                       "ethnicity":  "Mixed",
                       "nationality":  "American",
                       "hair_colour":  "Blonde",
                       "eye_colour":  "Green",
                       "height":  "165cm",
                       "tattoos":  "left buttock, Text \u0027hit em wit the riddim\u0027; nape and right shoulder blade, Text \u0027starve the ego, feed the soul\u0027; right inner wrist, Black heart; right side of lower abdomen, Heart with banner \u0027Mom\u0027",
                       "piercings":  "Septum",
                       "career_start_year":  2023
                   },
        "image":  "https://cdn.theporndb.net/performer/24/21/b4/e4603fcb5df6a144d787377ecbae4ab/poster/madison-blaze.webp"
    },
     {
        "_id": 83143,
        "name": "Khloe Kapri",
        "disambiguation": null,
        "bio": "Khloe Kapri is an intelligent, young girl with quite the wild side when she gets in front of a camera. If you like petite, all-natural blondes, Khloe is the girl you’ve been waiting for. This little hottie has a real cute and innocent quality about her, but don’t let that fool you because she can take a pounding with the best of them. Khloe has only been in the industry since 2016, but she has already made quite the name for herself and stars in in variety of genres such as threesome, hardcore, lesbian and big dick. While she may be able to make a living with her amazing body, she still recognizes the importance of education, having graduated from high school and attended university as an architecture major. Although she has yet to complete her studies, she fully plans to finish her education and earn her degree. A career in porn is not exactly a typical path for a girl growing up in Ohio, but that was not going to stop Khloe from doing her thing. She got her first chance to break into the world of porn through one of her girlfriends who worked in the industry, Kelly Green. The idea of fucking on camera definitely peaked Khloe’s interest, but she still wanted to have her own fun in college first. Eventually she came around and decided it was time to give porn a shot. At first she thought it would just be a fun thing to try over spring break, but she quickly fell in love with it and now she’s obsessed with fucking on camera. She may have come out of her shell when she first got on set, but this little naughty blonde has always had the moves to make the boys want her. A self-proclaimed slut in high school, Khloe has plenty of great stories from over the years. Her very first time having sex was actually the first time she had ever met the guy! She was out on a double date (even though her parents did not allow her to date at the time) and they ended up fooling around in a park. Before you knew it she had her tight, little jean shorts pulled to the side as she rode her date’s dick. Even an old woman walking by the park and saying hello didn’t stop them! When it comes to the craziest thing she’s ever done sexually, Khloe has a long list to choose from, but her personal favorite is sucking dick in the back of class at Sunday school. Amen to that! When it comes to her future, Khloe is still unsure of where she’ll end up. Perhaps she’ll continue working in the industry for many years to come, or maybe she’ll head back home to Ohio and take over the family business. In the meantime, she’s going to enjoy every video she shoots and every dick she rides!",
        "extras": {
            "gender": "Female",
            "birthday": "1997-06-27",
            "birthplace": "United States",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Blonde",
            "eye_colour": "Blue",
            "weight": "49kg",
            "height": "157cm",
            "measurements": "32B-24-36",
            "cupsize": "32B",
            "tattoos": "No Tattoos",
            "piercings": "Navel; Nipples",
            "career_start_year": 2017
        },
        "image": "https://cdn.theporndb.net/performer/50/aa/dd/5d17f9dc56277b5dff2d8c0e636375a/poster/khloe-kapri-from-stashdb.jpg"
    },{
        "_id": 169856,
        "name": "Molly Little",
        "disambiguation": null,
        "bio": "A super skinny delight with big doe eyes and a petite frame, Molly Little is one of our hottest newcomers to date. She's as passionate as it gets when it comes to getting the pleasure her tight little body so obviously craves! She can't wait to get it on!",
        "extras": {
            "gender": "Female",
            "birthday": "2003-02-10",
            "birthplace": "United States",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Blonde",
            "eye_colour": "Brown",
            "weight": "41kg",
            "height": "160cm",
            "measurements": "32A-22-32",
            "cupsize": "32A",
            "tattoos": "Near left thumb (Butterfly), Upper abdomen (Three mushrooms)",
            "piercings": "None",
            "career_start_year": 2022
        },
        "image": "https://cdn.theporndb.net/performer/4f/cc/f0/84db69d6d714a4e8e5150a2adc6da3e/poster/6xK3xjPCnzywyJMseHHEBfteghftgJ-metaTW9sbHkgTGl0dGxlIDEuanBn-.jpg"
    },
    {
        "_id": 84146,
        "name": "Chloe Amour",
        "disambiguation": null,
        "bio": "Dark-haired, bronze-skinned Amateur Chloe Michele hails from San Antonio, Texas, where she works as a promotional model and leasing consultant. She’s Hispanic, but she doesn’t speak Spanish. “You could say I’m more of a ‘Tex-Mex’ kind of girl,” says Chloe. “I was born and raised here in San Antonio. I had a rough childhood – I didn’t have a lot of family or parental supervision – but all of the trials and tribulations of my life have made me who I am. I went to school with rich kids, and my family was really poor. It taught me to work hard for the things I wanted.” Chloe did some runway work in San Antonio, in addition to promotional modeling for a few beer and liquor brands – and her hard work paid off, because now she’s a Playboy Amateur. And she plays hard, too. She likes to go to movies, concerts, bowling or to a Cowboys game with the guys, and with the girls she likes to get her nails done, hit the pool and go bar-hopping downtown. “I love to make new friends, so it’s really liberating to be a Playboy model,” says Chloe. “It fulfills women’s and men’s fantasies.” And what about her fantasies? “I would love to have a career in modeling,” she says. “Dressed up or dressed down, I love to know that I’m being looked at and thought about. I have an amazing body, and I take good care of it. My best assets are my smooth skin, full lips and breasts – I get compliments on them every day.” But don’t get any ideas - Chloe is single, and she likes it that way. “I can do whatever I want whenever I want – and that includes seeing anybody that I want,” she declares. “I have no limits, and it’s no one else’s business who I talk to, who I take home. I'm open in my sexuality, and I’ll try anything once.”",
        "extras": {
            "gender": "Female",
            "birthday": "1991-05-30",
            "birthplace": "San Antonio",
            "ethnicity": "Latin",
            "nationality": "American",
            "hair_colour": "Brunette",
            "eye_colour": "Brown",
            "weight": "50kg",
            "height": "162cm",
            "measurements": "34C-27-40",
            "cupsize": "34C",
            "tattoos": "Left wrist; upper back",
            "piercings": "Navel",
            "career_start_year": 2013
        },
        "image": "https://cdn.theporndb.net/performer/c0/14/93/cca353f375169cefc8577f6206a92df/poster/chloe-amour.webp"
    },
    {
        "_id": 288955,
        "name": "Alexis James",
        "disambiguation": null,
        "bio": null,
        "extras": {
            "gender": "Female",
            "birthday": "1994-08-14",
            "birthplace": "New York, Usa",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Blonde",
            "eye_colour": "Green",
            "weight": "44kg",
            "height": "165  cm",
            "measurements": "32C-23-33",
            "cupsize": "32C",
            "tattoos": null,
            "piercings": null,
            "career_start_year": 2023
        },
        "image": "https://cdn.theporndb.net/performer/c3/b1/89/5e16b124fa44e0538e5875bc8bc3910/poster/alexis-james.jpg"
    },
    {
        "_id": 82872,
        "name": "Alex Coal",
        "disambiguation": null,
        "bio": "Born in 1991 in Sin City, Alex Coal was seemingly destined for a career in skin flicks. This five-foot-five raven-haired honey is the perfect picture of all-natural perfection. This broad is so classy that when she pushes her ass-cheeks together, you\u0027ll think you\u0027re looking at the Coco Chanel logo. She also tends to sport an expertly-maintained landing strip right above her pussy. \"This is your captain speaking, please stow your tray tables and put your seats in the upright position as we will be touching down in Alex\u0027s pussy momentarily.\" Talk about a holiday destination. Ms. Coal has a stunning set of sea-blue eyes that you could just about drown in. She\u0027s been in the industry since 2019, and shot some amazing scenes so far. Thankfully, she also just started shooting in VR, it\u0027s no wonder that she has over 100k followers on Twitter. For someone so new to porn, she\u0027s shot a ton of scenes, and her performances get better with each shoot. There\u0027s only one way to really understand how stunning this girl is - and that\u0027s through 180 degree stereoscopic VR.",
        "extras": {
            "gender": "Female",
            "birthday": "1991-06-05",
            "birthday_timestamp": 676080000,
            "birthplace": "Las Vegas, NV, USA",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Various",
            "eye_colour": "Blue",
            "weight": "49kg",
            "height": "165cm",
            "measurements": "34B-24-36",
            "cupsize": "34B",
            "tattoos": "No Tattoos",
            "piercings": "No Piercings",
            "career_start_year": 2015
        },
        "image": "https://cdn.theporndb.net/performer/c9/6d/f4/6ea8b2418a351991e4315417ff1035e/poster/alex-coal.jpg"
    },
    {
        "_id": 82955,
        "name": "Eliza Ibarra",
        "disambiguation": null,
        "bio": "Twenty-one-year-old Eliza Ibarra started shooting porn at the beginning of 2018 and has already gained a significant following. Her Instagram account is on the cusp of 100k and she’s got over fifty thousand fappers following her on Twitter where she posts plenty of sexy video clips and BTS snapshots. Eliza was born in Riverside, California, only about 20 miles outside of LA. If you search her name on Pornhub, you’ll find a healthy handful of diverse scenes including hardcore, lesbian, threesome, and interracial scenes. With such a gorgeous face and a bangin\u0027 body to boot, she could easily be a runway model or mainstream actress, but lucky for us, she chose porn. Eliza has shot with some of the industry’s major studios including Brazzers, Blacked, and Nubile Films, but we hadn’t seen her in any other cosplay scenes. Once we got a good look at her dark brown eyes, hourglass figure, and ample buttocks, something clicked within our collective nerdy consciousness and we knew we had to cast her as Santanico Pandemonium in our Dusk Till Dawn parody. Whether she’s taking a rough pounding, deepthroating dick, or plundering pussy, her performances are always red hot. But when she’s dancing for you as the sexy stripper slash vampire, Santanico, she becomes something else entirely. Grab your VR headset and jump into this immersive XXX parody for one of the wildest rides so far on VRCosplayX.",
        "extras": {
            "gender": "Female",
            "birthday": "1997-03-22",
            "birthday_timestamp": 858988800,
            "birthplace": "Riverside, CA, USA",
            "ethnicity": "Latin",
            "nationality": "American",
            "hair_colour": "Brunette",
            "eye_colour": "Brown",
            "weight": "50kg",
            "height": "175cm",
            "measurements": "34B-25-37",
            "cupsize": "34B",
            "tattoos": "No",
            "piercings": "No",
            "career_start_year": 2018
        },
        "image": "https://cdn.theporndb.net/performer/10/3d/25/9b3cec23f940f13e4fbb3bfd92f6ea3/poster/01J0X308JQXVYGMBDJR7DTVXAR.jpg"
    },
    {
        "_id": 83207,
        "name": "Hime Marie",
        "disambiguation": null,
        "bio": "You might have never heard about Hime Marie but we assure you that as soon as you will get to know this beautiful VR porn star you are going to fall in love with her in no time. This barely 18 VR porn babe from Arizona is a teen Latina who used to be a makeup artist – but now is a growing legend of virtual reality porn, who gets new and new fans of her sex performing with each and every day of her presence ... arrow_drop_down You might have never heard about Hime Marie but we assure you that as soon as you will get to know this beautiful VR porn star you are going to fall in love with her in no time. This barely 18 VR porn babe from Arizona is a teen Latina who used to be a makeup artist – but now is a growing legend of virtual reality porn, who gets new and new fans of her sex performing with each and every day of her presence online. She believes that VR porn looks very nice but claims that it is harder to shoot such sex scenes – and even though we agree with that and admit that it is kinda more complicated to produce VR porn videos than regular XXX movies, we believe that our VR porn experiences are so good that they are definitely worth it. You should probably know that Hime just loves anal fucking and if you want to have sex with her, you should be well-aware that her tight ass will be waiting for you at least as much as her narrow juicy pussy – and since we all love some hardcore anal fucking, we believe that this “trait” of this professional VR porn star is truly charming and we just adore her for that. She loves getting food after a good fucking and she doesn’t mind lesbian VR porn movies – although she still prefers regular, BG VR porn videos – and as soon as you will visit one of her VR porn scenes at VRBangers.com, you will surely get to fuck her really soon in one of her favorite sexual positions like doggy or reverse cowgirl. She told us that her hidden sexual fantasy is to have a Star Wars-themed gangbang VR porn video – perhaps one day we will make her erotic dream cum true… and what do you think about that? arrow_drop_up",
        "extras": {
            "gender": "Female",
            "birthday": "1995-08-23",
            "birthday_timestamp": 809136000,
            "birthplace": "Albuquerque, New Mexico, USA",
            "ethnicity": "Latin",
            "nationality": "American",
            "hair_colour": "Various",
            "eye_colour": "Brown",
            "weight": "45kg",
            "height": "157cm",
            "measurements": "32A-27-35",
            "cupsize": "32A",
            "tattoos": "No Tattoos",
            "piercings": "No Piercings",
            "career_start_year": 2017
        },
        "image": "https://cdn.theporndb.net/performer/b5/79/59/d2131f22c1ea320f7b6157ecd7acc97/poster/hime-marie.jpg"
    },
    {
        "_id": 83209,
        "name": "Lilly Bell",
        "disambiguation": null,
        "bio": "All-natural blonde babe Lilly Bell has finally come to BaDoinkVR. Grab your headset and check out this stunning mythical sex beast in 5k 180 degree stereoscopic VR. Yes sir, this girl is basically Medusa - she’ll turn your cock to stone just by flashing you a glance. With beautiful blue eyes, perky C cup titties, and a petite, 100-pound frame, you don’t stand a chance against Lilly. Ms. Bell’s ass is so fine that the chairs that she sits on rejoice on a daily basis. With a couple of piercings and tattoos, Lilly is every bit as classy as she is edgy. Her pussy constantly craves dick, it literally drools for it. Her dick sucking skills are unparalleled. Lilly was born in 1996 and in her 24 years of life she’s become one hell of a woman. Should she harness the full power of her beauty, she will dominate the world. There’s nothing we can do about it, so let’s just embrace it, shall we? Grab your Oculus Go, Quest, or PSVR and introduce yourself to the stunning Lilly Bell, right here at BaDoinkVR.",
        "extras": {
            "gender": "Female",
            "birthday": "1996-01-11",
            "birthday_timestamp": 821318400,
            "birthplace": "CA, USA",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Blonde",
            "eye_colour": "Blue",
            "weight": "48kg",
            "height": "157cm",
            "measurements": "32C-24-34",
            "cupsize": "32C",
            "tattoos": "Center of upper back; upper right buttock(heart stencil)",
            "piercings": "Left nostril",
            "career_start_year": 2019
        },
        "image": "https://cdn.theporndb.net/performer/e2/ec/44/3138780a38f8053672364c3cf706093/poster/lilly-bell.jpg"
    },
    {
        "_id": 83356,
        "name": "Paris White",
        "disambiguation": null,
        "bio": "Paris White is an extremely hot blonde adult model from Montana, who, even though being barely 22 years old, has managed to steal our hearts and become one of our favorite golden-haired VR porn stars. We loved her go-to attitude and talents so much that we decided to feature her in the most blonde of our blonde VR porn movies – if you have seen this VR porn scene then you definitely know what are we talking ... arrow_drop_down Paris White is an extremely hot blonde adult model from Montana, who, even though being barely 22 years old, has managed to steal our hearts and become one of our favorite golden-haired VR porn stars. We loved her go-to attitude and talents so much that we decided to feature her in the most blonde of our blonde VR porn movies – if you have seen this VR porn scene then you definitely know what are we talking about, and thus you know what is so special about this teen VR porn model. She is cute and petite, owning a pair of tiny yet deliciously looking boobs, and even though you may consider her being too young for knowing some of the best sexual tricks, you will be surprised by all her erotic talents and capabilities – especially those showcased in front of our 360 degrees virtual reality porn camera. She is in the adult business for 1 year only and we have produced one of her very first VR porn videos at all – yet she told us that “VR is unlike any other videos because it gives the viewer an incredible experience that is interactive and more realistic than a regular video. It is also very intimate and feels like you are right in the middle of the action.” We could not ask for a better reference for our virtual reality porn scenes and we are utterly glad to have her amongst our professional VR porn stars – wear your VR headset and watch this blonde VR porn vixen as soon as possible! She loves VR, BDSM, ASMR and all kinds of passionate scenes – so we are sure that you two will find something in common and that you will undeniably become one of her biggest fans, just like VR Bangers, in no time! arrow_drop_up",
        "extras": {
            "gender": "Female",
            "birthday": "1998-02-12",
            "birthday_timestamp": 887241600,
            "birthplace": "USA",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Blonde",
            "eye_colour": "Blue",
            "weight": "45kg",
            "height": "155cm",
            "measurements": "32B-24-34",
            "cupsize": "32B",
            "tattoos": "Inside left wrist; Inside right biceps; Left shoulder and biceps; Lower right biceps",
            "piercings": "No Piercings",
            "career_start_year": 2018
        },
        "image": "https://cdn.theporndb.net/performer/4d/5c/70/b0a2cca04afa2cfadfbadd759bfed6e/poster/paris-white.webp"
    },
    {
        "_id": 83746,
        "name": "Ember Snow",
        "disambiguation": null,
        "bio": "Ember Snow is a petite Asian pornstar with Philippine origins. You could effortlessly toss this spinner onto a dick and spin her ‘round, and she’d be sexually satisfied. She had natural 34B tits until Ember Snow enlarged her breasts from B-Cup to D-Cup in 2022. No wonder that this hot piece of ass is often followed by a trail of drooling guys. Entering the biz in 2017, she tried her hand at porn in about 10 movies that year—mostly in some good old-fashioned hardcore smut and some blowjob action. She hopes to do more performing soon! Ember was just a dorky girl trying to avoid the strict rules at home by going on the Web and playing games. She was very curious about porn even though she wasn’t sexually experienced. She wanted to live out her sexual fantasies in a safe environment, and adult entertainment seemed like a good way to do so. The financial opportunities were nice, too. Before doing boy/girl, Ember did lesbian films exclusively. She likes girls in real life and was once in a lesbian relationship for 3 years, so girl/girl came naturally to her…and she cums naturally from it. This built up her fans’ desire to see her fuck before she graduated to boy/girl. Preferring to be on top when she fucks, she’s not a submissive chick. She wants to be in control and use a guy for her own pleasure. She hasn’t yet acted out a lot of her kinky sex fantasies, but she will eventually if she sticks around the porn industry for a while and develops her confidence.",
        "extras": {
            "gender": "Female",
            "birthday": "1996-02-27",
            "birthday_timestamp": 825379200,
            "birthplace": "Manila, Philippines",
            "ethnicity": "Asian",
            "nationality": "American",
            "hair_colour": "Black",
            "eye_colour": "Brown",
            "weight": "43kg",
            "height": "150cm",
            "measurements": "32D-24-34",
            "cupsize": "32D",
            "tattoos": "No Tattoos",
            "piercings": "No Piercings",
            "career_start_year": 2017
        },
        "image": "https://cdn.theporndb.net/performer/22/c4/fd/74378865807d1d39b11b4a2f9f29bb3/poster/ember-snow.png"
    },
    {
        "_id": 95334,
        "name": "Kylie Rocket",
        "disambiguation": null,
        "bio": "Fuck raven-haired teen, Kylie Rocket in 5k 180 degree stereoscopic virtual reality here at BaDoinkVR. What can we say about Kylie? Well, we can say that this five-foot-three, ninety-eight-pound spinner now has a year of XP in the porn industry. Born in 2001, this all-natural green-eyed minx packs much more of a punch than you may expect. She’s already got over 35k Twitter followers and that number is growing fast. Take one look at her profile and you’ll understand why. It’s a constant barrage of pussy licking, deep throating, and hardcore penetration. Kylie looks goof fully clothed, decked out in elaborate lingerie, and stark naked. She’s just 100% attractive all the time. Believe us, we know that’s quite a statement. But it’s true. Grab your Oculus Quest 2, Go, or HTC Vive and fuck Kylie as her porn career makes it’s first journey around the sun. Before you know it, you’ll have a rocket in your pocket.",
        "extras": {
            "gender": "Female",
            "birthday": "2001-04-11",
            "birthday_timestamp": 986947200,
            "birthplace": "United States",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Black",
            "eye_colour": "Green",
            "weight": "45kg",
            "height": "161cm",
            "measurements": "32A-24-34",
            "cupsize": "32A",
            "tattoos": "Along upper half of spine",
            "piercings": "No Piercings",
            "career_start_year": 2019
        },
        "image": "https://cdn.theporndb.net/performer/89/34/9f/6ae288ea93072ee1adea7216dabb721/poster/kylie-rocket.png"
    },
    {
        "_id": 108628,
        "name": "Codi Vore",
        "disambiguation": null,
        "bio": "Blonde sex vixen Codi Vore began her journey into the adult entertainment industry in 2017 and is having a great time gaining popularity and having sex with some of the hottest stars, much to our delight! Born in May of 1995, Vore was 22 years old when she started shooting adult movies. Codi is 5’2” tall and weighs 138 pounds. She has massive K-cup titties that must be seen if you’re a fan of busty boobs! Codi has full-body measurements of 30K-28-36. Codi has numerous films with The Score Group studio, including “Bad Girls and Ball Gags”, “Codi Vore is Coming Clean”, and “Codi\u0027s Garden of Big Boobed Dreams”. Vore has filmed with pornstars like Milly Marks, and most of her scenes are in the masturbation, boy/girl, and lesbian genres. She won the award for MV Boobs of the Year and has a fantastic laugh and smile. Her fanbase has multiplied rapidly in a short period, and Vore plans to continue working hard and having fun. In her personal life, the big-breasted model loves singing, pineapple pizza, and oxford commas. Codi has blonde hair and sexy grey eyes. Movies often feature her giant tits getting covered in cum. Codi loves getting new clothes and bras and has a very healthy masturbation life, in addition to all the sex she gets. She has many roleplay scenes, with some fun ones involving superhero vs. succubus, breast obsession therapy, and study partners. Codi Vore has lots of fun with her work, and she’s still actively showing off her busty body, much to the pleasure of fans old and new. With more scenes still coming out, we’re sure to add to our impressive collection. Enjoy our wonderful selection and let us know what you think!",
        "extras": {
            "gender": "Female",
            "birthday": "1995-05-18",
            "birthday_timestamp": 800755200,
            "birthplace": "Las Vegas, USA",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Blonde",
            "eye_colour": "Green",
            "weight": "63kg",
            "height": "157cm",
            "measurements": "32J-30-40",
            "cupsize": "32J",
            "tattoos": "None",
            "piercings": "None"
        },
        "image": "https://cdn.theporndb.net/performer/ff/ee/d4/26943baa9f06ec094de7e6fa3ddc440/poster/codi-vore.webp"
    },
    {
        "_id": 109546,
        "name": "Megan Maiden",
        "disambiguation": null,
        "bio": null,
        "extras": {
            "gender": "Female",
            "birthday": "1997-07-02",
            "birthday_timestamp": 867801600,
            "birthplace": "Boston, Massachusetts USA ",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Black",
            "weight": "66kg",
            "height": "170cm",
            "measurements": "34D-29-40",
            "cupsize": "34D",
            "tattoos": "Various",
            "piercings": "Nose and Belly button"
        },
        "image": "https://cdn.theporndb.net/performer/5d/73/3a/d049e04b56f3195f4546e71da877f3c/poster/1952a89eaf49c17b5d56b1fb2099c2ddf85d3c56"
    },
    {
        "_id": 128965,
        "name": "Jazmin Luv",
        "disambiguation": null,
        "bio": "Jaw dropping gorgeous with a body built for porn, it\u0027s no wonder Jazmin Luv hails from Sin City, Las Vegas. She is brand spanking new to the world of porn, but no doubt she is going to be around for awhile.",
        "extras": {
            "gender": "Female",
            "birthday": "1999-10-27",
            "birthday_timestamp": 940982400,
            "birthplace": "Las Vegas, NV, USA",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Brunette",
            "eye_colour": "Brown",
            "weight": "57kg",
            "height": "163cm",
            "measurements": "34B-24-34",
            "cupsize": "34B",
            "tattoos": "Fingers of left hand, \"1999\" and Hearts",
            "piercings": "No Piercings",
            "career_start_year": 2020
        },
        "image": "https://cdn.theporndb.net/performer/ee/9a/ea/218791b5ee8e2da1e22aae8375a2952/poster/jazmin-luv.jpg"
    },
    {
        "_id": 141142,
        "name": "Xxlayna Marie",
        "disambiguation": null,
        "bio": "XxLayna is pronounced \"Yuh-Layna\", which means trust, truth and light. Marie has the meaning of a starfish. This long-haired brunette has an incredibly cute face and big brown eyes that shine like gemstones. She is one of the new starlets in the porn industry. Her body is fit, toned and has stunning curves. She never wears a bra that could conceal her beautiful breasts. Her perfectly shaped and firm ass leaves her fans speechless and invites them to dream.\r\nShe is half Latina and half Cherokee Native American. She grew up in Oregon in a large family with many siblings, which made her grow up quite quickly. As a teenager, she was still shy.\r\nShe started her \"OnlyFans\" profile already in June 2020, which she promoted on Twitter from January 2021 on.\r\nShe was nominated for \"Best New Starlet\" at the AVN Awards and XBiz Awards in 2023, but defeated to Charly Summer and Nicole Doshi respectively.",
        "extras": {
            "gender": "Female",
            "birthday": "2000-03-06",
            "birthday_timestamp": 952300800,
            "birthplace": "Oregon, USA",
            "ethnicity": "Mixed",
            "nationality": "American",
            "hair_colour": "Brunette",
            "eye_colour": "Brown",
            "weight": "45kg",
            "height": "152cm",
            "measurements": "28C-24-30",
            "cupsize": "28C",
            "tattoos": "Under left forearm, Script",
            "piercings": "Left nostril; Navel; tounge",
            "career_start_year": 2021
        },
        "image": "https://cdn.theporndb.net/performer/0e/c7/c2/3080caa11503d9898678302f2e301ec/poster/xxlayna-marie-real-vr-porn-videos-on-badoink.jpeg"
    },
    {
        "_id":  84074,
        "name":  "Zaya Cassidy",
        "disambiguation":  null,
        "bio":  "If there was only one word to describe Native American hottie Zaya Cassidy, it would be \"tight.\" This tiny babe is a perfect combination of perky tits, firm ass, and a mouth with more sucking power than a vacuum. Boasting her blowjob prowess, Zaya says there is nothing that turns her on more than giving a sloppy blowjob to a rock hard cock. \"You know that when he cums, he\u0027s cumming for you,\" says the adorable babe, \"you feel accomplished.\" Of course she didn\u0027t just wake up one morning wanting to be a pornstar, it was a gradual process with a highlight reel that includes a ton of exhibitionism and lots of juicy cock. At 18, Zaya decided to put her top-tier dick sucking abilities to the test in a professional setting and hasn\u0027t looked back. Despite her tiny stature, this bite-sized cutie always finds herself getting paired up with the biggest dicks in the industry. Watching as her small caramel pussy gets absolutely filled to the brim by a massive cock is truly a sight to behold. With every new steamy scene she\u0027s in, Zaya is stretching the limits for how much her tight holes can handle.",
        "extras":  {
                       "gender":  "Female",
                       "birthday":  "1997-08-04",
                       "birthday_timestamp":  870652800,
                       "birthplace":  "Dallas ",
                       "ethnicity":  "Latin",
                       "nationality":  "American",
                       "hair_colour":  "Brunette",
                       "eye_colour":  "Brown",
                       "weight":  "45kg",
                       "height":  "154cm",
                       "measurements":  "32A-25-35",
                       "cupsize":  "32A",
                       "tattoos":  "Left Forearm, Designs",
                       "piercings":  "No Piercings",
                       "career_start_year":  2015
                   },
        "image":  "https://cdn.theporndb.net/performer/ef/1c/56/047dca0dbb74e7947098a3a61847159/poster/f65dbaced06b2cd9cd933cc5d4609b1020d03755"
    },
    {
        "_id": 179769,
        "name": "Little Puck",
        "disambiguation": null,
        "bio": "In daydreams and on screen, Little Puck switches off and becomes nothing but a sex machine. A bimbo milf with huge, fake naturals. The devil’s daughter with come-hither eyes.\n\nShe has been a performer of many kinds for many years but the need for sexual expression has always been a consistent thread in her narrative. Her movies celebrate her psyche’s emergence, once buried from years of repression within a strict Christian upbringing. Her big tits and filming porn makes her feel powerful and free.",
        "extras": {
            "gender": "Female",
            "birthday": "1988-12-18",
            "birthday_timestamp": 598406400,
            "birthplace": "California, US",
            "ethnicity": "Mixed",
            "nationality": "American",
            "hair_colour": "Brunette",
            "eye_colour": "Hazel",
            "height": "170cm",
            "measurements": "36DDD-30-41",
            "cupsize": "36DDD",
            "tattoos": "Arm; Calf; Left flank, \"Dulce et decorum est Pro patria mori\" sideways; Rib; Wrist",
            "piercings": "Navel",
            "career_start_year": 2019
        },
        "image": "https://cdn.theporndb.net/performer/41/7c/4c/8998e0f4eaa30caab9d7674b18a706c/poster/little-puck-on-anal-vids.jpg"
    },
    {
        "_id": 287400,
        "name": "Ellie Nova",
        "disambiguation": null,
        "bio": "Ellie Nova was born in Victorville, California, to a Jamaican dad and Venezuelan mom. She lived in Compton, Los Angeles for some time until their apartment complex blew up due to a meth lab explosion. Her family moved to Canada, where she completed her education quickly due to her eidetic memory. She graduated high school at 16, earned her Bachelor\u0027s Degree at 18, and a Master\u0027s Degree at 20. She is currently pursuing her PhD.\r\n\r\nEllie enjoys modeling and was involved in regular modeling as well as doing commercial work as a teenager. She has a unique hourglass shape, which she credits to her 15 years of training in Russian Ballet. She currently resides in Corpus Christi, Texas, and started her career in the adult film industry in 2023 with scenes for Net Video Girls. She reveals that she is a very sexual person and had already been involved in a number of sexual encounters before entering the industry. Her unique experiences have shaped her preference for BDSM, hardcore sex, and her dislike for scat and anal activities on camera. In her personal life, Ellie is attracted to dominant, masculine men who are taller than her and enjoys being with feminine women.",
        "extras": {
            "gender": "Female",
            "birthday": "2003-02-01",
            "birthday_timestamp": 1044057600,
            "birthplace": "Victorville, California USA",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Brunette",
            "eye_colour": "Brown",
            "weight": "57kg",
            "height": "175cm",
            "measurements": "34D-21-36",
            "cupsize": "34D",
            "tattoos": "Script \u0027have courage to be kind\u0027 left inner forearm",
            "career_start_year": 2023
        },
        "image": "https://cdn.theporndb.net/performer/f7/20/8b/027c0e583775dbeabc2d8599fb339bb/poster/01HHW1Q2DQEF8BX2KZFFNESNQV.jpg"
    },
    {
        "_id": 292516,
        "name": "Beca Barbie",
        "disambiguation": null,
        "bio": "This hot Latina performer named Beca Barbie, also known as Bec The Barbie, has been a part of the adult world since her hardcore debut in 2023. She comes from the Pacific Northwest and this sexy Aquarius stands in at around 5-foot-5. Your jaw will hit the floor when you see her sweet round booty.",
        "extras": {
            "gender": "Female",
            "birthday": "2001-02-09",
            "birthday_timestamp": 981676800,
            "birthplace": "United States",
            "ethnicity": "Latin",
            "nationality": "American",
            "hair_colour": "Black",
            "eye_colour": "Green",
            "weight": "62kg",
            "height": "165cm",
            "measurements": "34B-37-25",
            "cupsize": "34B",
            "tattoos": "Various",
            "piercings": "None",
            "career_start_year": 2023
        },
        "image": "https://cdn.theporndb.net/performer/1c/4d/eb/f04c785acb7dd7399787c20197c9907/poster/01HV9ZQNZ9NGZ3XBBR3JTXJGFH.jpg"
    },
    {
        "_id": 387206,
        "name": "Aderes Quin",
        "disambiguation": null,
        "bio": "Aderes Quin got her start in the adult industry by selling pictures of her feet. Thank OnlyFans and co for delivering a jumpstart and a steady flow of sluts.",
        "extras": {
            "gender": "Female",
            "birthday": "1994-03-30",
            "birthday_timestamp": 764985600,
            "birthplace": "Los Angeles, CA, USA",
            "ethnicity": "Caucasian",
            "nationality": "American",
            "hair_colour": "Blonde",
            "eye_colour": "Brown",
            "weight": "57kg",
            "height": "157cm",
            "measurements": "36DD-26-35",
            "cupsize": "36DD",
            "tattoos": "Yes",
            "piercings": "No",
            "career_start_year": 2023
        },
        "image": "https://cdn.theporndb.net/performer/f4/f0/14/82d775700fa0315ebc293788a491015/poster/aderes-quin.jpg"
    },
    {
        "_id": 407758,
        "name": "Julia James",
        "disambiguation": "Brunette, b2005, USA",
        "bio": "There truly is something so incredibly exciting about discovering that hot newbie to add to your lust list. Especially if that model encompasses so many of the characteristics you’d look for in a young and exquisitely sexy up and cummer. A prime example of this is the super cute spinner babe Julia James! Hailing from the Golden State, she’s a fresh new face in adult entertainment, whose career started in early 2025. She absolutely loves rough sex, and the harder it is, the more this minx loves it! Guys, get ready to goon on your day away as you watch Julia work her sexy magic for your viewing pleasure.",
        "extras": {
            "gender": "Female",
            "birthday": "2005-04-01",
            "birthday_timestamp": 1112313600,
            "birthplace": "San Fernando Valley, California, United States",
            "ethnicity": "Mixed",
            "nationality": "Russian/Indian",
            "hair_colour": "Black",
            "eye_colour": "Brown",
            "weight": "50kg",
            "height": "162cm",
            "measurements": "36A-26-36",
            "cupsize": "36A",
            "career_start_year": 2024
        },
        "image": "https://cdn.theporndb.net/performer/2d/db/46/76949bd47948d498761fc4e67c35732/poster/julia-juice-on-nubiles.jpeg"
    },
    {
        "_id": 415035,
        "name": "Laynee James",
        "disambiguation": null,
        "bio": "Slim, dark haired and beautiful, this breathtaking lady is Laynee James. You can guarantee the perfect display with this knockout, executed perfected and always with quality assurance where her partner is concerned.",
        "extras": {
            "gender": "Female",
            "birthday": "2001-01-01",
            "birthday_timestamp": 978307200,
            "birthplace": "United States",
            "ethnicity": "Mixed",
            "nationality": "American",
            "hair_colour": "Brunette",
            "eye_colour": "Brown",
            "weight": "45kg",
            "height": "160cm",
            "career_start_year": 2025
        },
        "image": "https://cdn.theporndb.net/performer/5e/2a/c4/37d814aa53739b076be5b1311a0a67d/poster/laynee-james-from-stashdb.jpg"
    }

]







